test_cases/cylinder2D_variable_intake/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  com                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            exprFixedValue;
        value           $internalField;
        mean            2.5;
        amplitude       1.5;
        o_period        2.0;

        valueExpr      "4*1.5*pos().y()*(0.41-pos().y())*($mean + $amplitude * sin(2*pi()/$o_period*time()))/(0.41*0.41) * vector(1, 0, 0)";
    }

    outlet
    {
        type            zeroGradient;
    }

    "(cylinder|top|bottom)"
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
